In [1]:
import pandas as pd
import numpy as np
import datetime

In [2]:
raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
'age': [20, 19, 22, 21],
'favorite_color': ['blue', 'red', 'yellow', "green"],
'grade': [88, 92, 95, 70],
'birth_date': ['01-02-1996', '08-05-1997', '04-28-1996', '12-16-1995']}

In [3]:
df = pd.DataFrame(raw_data, index = ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'])
print(df.head)

<bound method NDFrame.head of                               name  age favorite_color  grade  birth_date
Willard Morris      Willard Morris   20           blue     88  01-02-1996
Al Jennings            Al Jennings   19            red     92  08-05-1997
Omar Mullins          Omar Mullins   22         yellow     95  04-28-1996
Spencer McDaniel  Spencer McDaniel   21          green     70  12-16-1995>

In [4]:
df.columns

Index(['name', 'age', 'favorite_color', 'grade', 'birth_date'], dtype='object')

In [5]:
df.dtypes

name              object
age                int64
favorite_color    object
grade              int64
birth_date        object
dtype: object

In [6]:
df.index

Index(['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'], dtype='object')

In [7]:
df.head()

                              name  age favorite_color  grade  birth_date
Willard Morris      Willard Morris   20           blue     88  01-02-1996
Al Jennings            Al Jennings   19            red     92  08-05-1997
Omar Mullins          Omar Mullins   22         yellow     95  04-28-1996
Spencer McDaniel  Spencer McDaniel   21          green     70  12-16-1995

In [8]:
df['year'] = pd.DatetimeIndex(df['birth_date']).year

In [9]:
df

,name,age,favorite_color,grade,birth_date,year
Willard Morris,Willard Morris,20,blue,88,01-02-1996,1996
Al Jennings,Al Jennings,19,red,92,08-05-1997,1997
Omar Mullins,Omar Mullins,22,yellow,95,04-28-1996,1996
Spencer McDaniel,Spencer McDaniel,21,green,70,12-16-1995,1995

In [10]:
df['month'] = pd.DatetimeIndex(df['birth_date']).month

In [11]:
df

,name,age,favorite_color,grade,birth_date,year,month
Willard Morris,Willard Morris,20,blue,88,01-02-1996,1996,1
Al Jennings,Al Jennings,19,red,92,08-05-1997,1997,8
Omar Mullins,Omar Mullins,22,yellow,95,04-28-1996,1996,4
Spencer McDaniel,Spencer McDaniel,21,green,70,12-16-1995,1995,12

In [12]:
df['month_year'] = pd.to_datetime(df['birth_date']).dt.to_period('M')

In [13]:
df

,name,age,favorite_color,grade,birth_date,year,month,month_year
Willard Morris,Willard Morris,20,blue,88,01-02-1996,1996,1,1996-01
Al Jennings,Al Jennings,19,red,92,08-05-1997,1997,8,1997-08
Omar Mullins,Omar Mullins,22,yellow,95,04-28-1996,1996,4,1996-04
Spencer McDaniel,Spencer McDaniel,21,green,70,12-16-1995,1995,12,1995-12

In [15]:
power = pd.read_csv("I:\\GitContent\\Datasets\\Datasets\\power.csv")

In [16]:
power.head()

  START_DATE      VALUE
0  15-Dec-17  32.009998
1  15-Dec-17  30.930000
2  15-Dec-17  29.000000
3  15-Dec-17  28.969999
4  15-Dec-17  29.570000

In [17]:
power.dtypes

START_DATE     object
VALUE         float64
dtype: object

In [32]:
type(power)

pandas.core.frame.DataFrame

In [30]:
df = pd.DataFrame(power)

In [31]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df.columns

Index(['START_DATE', 'VALUE'], dtype='object')

In [34]:
df.index

RangeIndex(start=0, stop=37623, step=1)

In [35]:
df.agg({'VALUE':['mean']})

          VALUE
mean  37.074421

In [42]:
print(df.agg({'VALUE':['mean']}),
df.agg({'VALUE':['max']}),
df.agg({'VALUE':['min']}),
df.agg({'VALUE':['std']}))

          VALUE
mean  37.074421          VALUE
max  77.141389       VALUE
min -3.3488          VALUE
std  11.824148

In [39]:
df.describe()

              VALUE
count  37623.000000
mean      37.074421
std       11.824148
min       -3.348800
25%       28.121282
50%       36.344839
75%       44.778500
max       77.141389

In [43]:
df['year'] = pd.DatetimeIndex(df['START_DATE']).year

In [45]:
df

      START_DATE      VALUE  year
0      15-Dec-17  32.009998  2017
1      15-Dec-17  30.930000  2017
2      15-Dec-17  29.000000  2017
3      15-Dec-17  28.969999  2017
4      15-Dec-17  29.570000  2017
...          ...        ...   ...
37618  31-Mar-22  44.524761  2022
37619  31-Mar-22  41.243295  2022
37620  31-Mar-22  39.866686  2022
37621  31-Mar-22  38.239598  2022
37622  31-Mar-22  38.611845  2022

[37623 rows x 3 columns]

In [46]:
df.groupby(['year']).agg({'VALUE':['mean']})

          VALUE
           mean
year
2017  31.541348
2018  38.183961
2019  36.200000
2020  36.250000
2021  36.800000
2022  41.650659

In [72]:
df = pd.read_json("I:\\GitContent\\Datasets\\Datasets\\recipes.json",lines=True)

In [73]:
Workdf = df.copy()

In [74]:
Workdf['cookTime'].unique()

array(['PT', 'PT10M', 'PT15M', 'PT20M', 'PT5M', 'PT25M', 'PT2M',
       'PT1H15M', 'PT1H', 'PT45M', 'PT30M', 'PT3H', 'PT18M', 'PT2H',
       'PT40M', 'PT3M', 'PT4H', 'PT7M', 'PT6H', 'PT12M', 'PT1H30M',
       'PT2H30M', 'PT11M', 'PT23M', 'PT9M', 'PT35M', 'PT9H', 'PT50M',
       'PT7H', 'PT8M', 'PT1H10M', 'PT6M', 'PT22M', 'PT13M', 'PT55M', '',
       'PT60M', 'PT120M', 'PT90M', 'PT100M', 'PT180M', 'PT70M'],
      dtype=object)

In [75]:
Workdf['prepTime'].unique()

array(['PT15M', 'PT6M', 'PT5M', 'PT10M', 'PT8H', 'PT20M', 'PT25M',
       'PT30M', 'PT6H', 'PT3H', 'PT1H', 'PT2H', 'PT45M', 'PT2M', 'PT',
       'PT3M', 'PT4H', 'PT1M', 'PT1H30M', 'PT24H', 'PT40M', 'PT1H15M',
       'PT35M', 'PT16M', 'PT18H', '', 'PT100M', 'PT900M', 'PT60M',
       'PT180M', 'PT240M', 'PT950M', 'PT120M', 'PT7M', 'PT150M', 'PT90M',
       'PT65M', 'PT245M'], dtype=object)

In [76]:
Workdf['cookTime'] = Workdf['cookTime'].replace(['PT',''],'PT0')

In [77]:
Workdf['cookTime'].unique()

array(['PT0', 'PT10M', 'PT15M', 'PT20M', 'PT5M', 'PT25M', 'PT2M',
       'PT1H15M', 'PT1H', 'PT45M', 'PT30M', 'PT3H', 'PT18M', 'PT2H',
       'PT40M', 'PT3M', 'PT4H', 'PT7M', 'PT6H', 'PT12M', 'PT1H30M',
       'PT2H30M', 'PT11M', 'PT23M', 'PT9M', 'PT35M', 'PT9H', 'PT50M',
       'PT7H', 'PT8M', 'PT1H10M', 'PT6M', 'PT22M', 'PT13M', 'PT55M',
       'PT60M', 'PT120M', 'PT90M', 'PT100M', 'PT180M', 'PT70M'],
      dtype=object)

In [78]:
Workdf['prepTime'] = Workdf['prepTime'].replace(['PT',''],'PT0')

In [79]:
Workdf['prepTime'].unique()

array(['PT15M', 'PT6M', 'PT5M', 'PT10M', 'PT8H', 'PT20M', 'PT25M',
       'PT30M', 'PT6H', 'PT3H', 'PT1H', 'PT2H', 'PT45M', 'PT2M', 'PT0',
       'PT3M', 'PT4H', 'PT1M', 'PT1H30M', 'PT24H', 'PT40M', 'PT1H15M',
       'PT35M', 'PT16M', 'PT18H', 'PT100M', 'PT900M', 'PT60M', 'PT180M',
       'PT240M', 'PT950M', 'PT120M', 'PT7M', 'PT150M', 'PT90M', 'PT65M',
       'PT245M'], dtype=object)

In [80]:
Workdf['prepTime'] = Workdf['prepTime'].apply(lambda n:n[2:])

In [81]:
Workdf['cookTime'] = Workdf['cookTime'].apply(lambda n:n[2:])

In [82]:
Workdf['prepTime'].unique()

array(['15M', '6M', '5M', '10M', '8H', '20M', '25M', '30M', '6H', '3H',
       '1H', '2H', '45M', '2M', '0', '3M', '4H', '1M', '1H30M', '24H',
       '40M', '1H15M', '35M', '16M', '18H', '100M', '900M', '60M', '180M',
       '240M', '950M', '120M', '7M', '150M', '90M', '65M', '245M'],
      dtype=object)

In [83]:
Workdf['cookTime'].unique()

array(['0', '10M', '15M', '20M', '5M', '25M', '2M', '1H15M', '1H', '45M',
       '30M', '3H', '18M', '2H', '40M', '3M', '4H', '7M', '6H', '12M',
       '1H30M', '2H30M', '11M', '23M', '9M', '35M', '9H', '50M', '7H',
       '8M', '1H10M', '6M', '22M', '13M', '55M', '60M', '120M', '90M',
       '100M', '180M', '70M'], dtype=object)

In [84]:
def timeff(x):
    n = pd.to_timedelta(x)
    return n

In [85]:
Workdf.dtypes

name             object
ingredients      object
url              object
image            object
cookTime         object
recipeYield      object
datePublished    object
prepTime         object
description      object
dtype: object

In [86]:
Workdf['cookTime'] = Workdf['cookTime'].apply(lambda n:timeff(n))

In [87]:
Workdf.dtypes

name                      object
ingredients               object
url                       object
image                     object
cookTime         timedelta64[ns]
recipeYield               object
datePublished             object
prepTime                  object
description               object
dtype: object

In [88]:
Workdf['cookTime'].unique()

array([             0,   600000000000,   900000000000,  1200000000000,
         300000000000,  1500000000000,   120000000000,  4500000000000,
        3600000000000,  2700000000000,  1800000000000, 10800000000000,
        1080000000000,  7200000000000,  2400000000000,   180000000000,
       14400000000000,   420000000000, 21600000000000,   720000000000,
        5400000000000,  9000000000000,   660000000000,  1380000000000,
         540000000000,  2100000000000, 32400000000000,  3000000000000,
       25200000000000,   480000000000,  4200000000000,   360000000000,
        1320000000000,   780000000000,  3300000000000,  6000000000000],
      dtype='timedelta64[ns]')

In [89]:
Workdf['prepTime'] = Workdf['prepTime'].apply(lambda n:timeff(n))

In [90]:
Workdf['prepTime'].unique()

array([  900000000000,   360000000000,   300000000000,   600000000000,
       28800000000000,  1200000000000,  1500000000000,  1800000000000,
       21600000000000, 10800000000000,  3600000000000,  7200000000000,
        2700000000000,   120000000000,              0,   180000000000,
       14400000000000,    60000000000,  5400000000000, 86400000000000,
        2400000000000,  4500000000000,  2100000000000,   960000000000,
       64800000000000,  6000000000000, 54000000000000, 57000000000000,
         420000000000,  9000000000000,  3900000000000, 14700000000000],
      dtype='timedelta64[ns]')

In [91]:
Workdf['cookTime'] = Workdf['cookTime']/np.timedelta64(1, 'm')

In [92]:
Workdf['prepTime'] = Workdf['prepTime']/np.timedelta64(1, 'm')